import type { StudyPlan } from '../types.ts';

export const initialPrimaryPlan: StudyPlan = {
  grades: {
    "الاول ابتدائي": {
      subjects: { "التربية الاسلامية": 2, "القراءة": 9, "اللغة الانكليزية": 3, "الرياضيات": 6, "العلوم": 4, "التربية الاخلاقية": 2, "التربية الفنية": 2, "التربية الرياضية": 2 },
      total: 30
    },
    "الثاني ابتدائي": {
      subjects: { "التربية الاسلامية": 3, "القراءة": 9, "اللغة الانكليزية": 3, "الرياضيات": 6, "العلوم": 4, "التربية الفنية": 2, "التربية الرياضية": 3 },
      total: 30
    },
    "الثالث ابتدائي": {
      subjects: { "التربية الاسلامية": 3, "القراءة": 9, "اللغة الانكليزية": 3, "الرياضيات": 6, "العلوم": 4, "التربية الفنية": 2, "التربية الرياضية": 3 },
      total: 30
    },
    "الرابع ابتدائي": {
      subjects: { "التربية الاسلامية": 3, "اللغة العربية": 8, "اللغة الانكليزية": 3, "الرياضيات": 6, "العلوم": 4, "الاجتماعيات": 3, "التربية الفنية": 2, "التربية الرياضية": 2 },
      total: 31
    },
    "الخامس ابتدائي": {
      subjects: { "التربية الاسلامية": 3, "اللغة العربية": 6, "اللغة الانكليزية": 4, "الرياضيات": 6, "العلوم": 4, "الاجتماعيات": 3, "التربية الفنية": 2, "التربية الرياضية": 2 },
      total: 30
    },
    "السادس ابتدائي": {
      subjects: { "التربية الاسلامية": 3, "اللغة العربية": 6, "اللغة الانكليزية": 5, "الرياضيات": 6, "العلوم": 4, "الاجتماعيات": 3, "التربية الفنية": 2, "التربية الرياضية": 2 },
      total: 31
    }
  }
};

export const initialIntermediatePlan: StudyPlan = {
  grades: {
    "الاول متوسط": {
      subjects: { "التربية الاسلامية": 2, "اللغة العربية": 5, "اللغة الانكليزية": 5, "الرياضيات": 5, "الاحياء": 2, "الكيمياء": 2, "الفيزياء": 2, "الاجتماعيات": 4, "التربية الفنية": 1, "التربية الرياضية": 1, "الحاسوب": 2 },
      total: 31
    },
    "الثاني متوسط": {
      subjects: { "التربية الاسلامية": 2, "اللغة العربية": 5, "اللغة الانكليزية": 5, "الرياضيات": 5, "الاحياء": 2, "الكيمياء": 2, "الفيزياء": 2, "الاجتماعيات": 4, "التربية الفنية": 1, "التربية الرياضية": 1, "الحاسوب": 2 },
      total: 31
    },
    "الثالث متوسط": {
      subjects: { "التربية الاسلامية": 2, "اللغة العربية": 5, "اللغة الانكليزية": 5, "الرياضيات": 5, "الاحياء": 2, "الكيمياء": 2, "الفيزياء": 2, "الاجتماعيات": 4, "التربية الفنية": 1, "التربية الرياضية": 2 },
      total: 30
    }
  }
};

export const initialPreparatoryPlan: StudyPlan = {
  grades: {
    "الرابع العلمي": {
      subjects: { "الاسلامية": 2, "العربية": 5, "الأنكليزية": 5, "الرياضيات": 4, "الكيمياء": 3, "الفيزياء": 3, "الاحياء": 3, "الكردية": 2, "الحاسوب": 2, "رياضة": 1, "فنية": 2 },
      total: 32
    },
    "الرابع الادبي": {
      subjects: { "الاسلامية": 2, "العربية": 6, "الأنكليزية": 5, "الرياضيات": 3, "التاريخ": 3, "جغرافية": 3, "الاجتماع": 3, "الكردية": 2, "الحاسوب": 2, "رياضة": 1, "فنية": 2 },
      total: 32
    },
    "الخامس العلمي": {
      subjects: { "الاسلامية": 2, "العربية": 4, "الأنكليزية": 5, "الرياضيات": 5, "الكيمياء": 3, "الفيزياء": 4, "الاحياء": 3, "الكردية": 1, "الحاسوب": 1, "رياضة": 1, "فنية": 1, "علم الارض": 2 },
      total: 32
    },
    "الخامس الادبي": {
      subjects: { "الاسلامية": 2, "العربية": 6, "الأنكليزية": 5, "الرياضيات": 4, "التاريخ": 3, "جغرافية": 3, "اقتصاد": 2, "فلسفة وعلم نفس": 3, "الكردية": 1, "الحاسوب": 2, "رياضة": 1, "فنية": 1 },
      total: 35
    },
    "السادس العلمي": {
      subjects: { "الاسلامية": 2, "العربية": 6, "الأنكليزية": 5, "الرياضيات": 5, "الكيمياء": 4, "الفيزياء": 4, "الاحياء": 4, "رياضة": 1, "فنية": 1 },
      total: 32
    },
    "السادس الادبي": {
      subjects: { "الاسلامية": 2, "العربية": 8, "الأنكليزية": 6, "الرياضيات": 4, "التاريخ": 3, "جغرافية": 3, "اقتصاد": 3, "رياضة": 1, "فنية": 1 },
      total: 31
    }
  }
};